----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 768, 24, 24]         590,592
          Identity-2             [-1, 576, 768]               0
        PatchEmbed-3             [-1, 576, 768]               0
           Dropout-4             [-1, 577, 768]               0
         LayerNorm-5             [-1, 577, 768]           1,536
            Linear-6            [-1, 577, 2304]       1,771,776
           Dropout-7         [-1, 12, 577, 577]               0
            Linear-8             [-1, 577, 768]         590,592
           Dropout-9             [-1, 577, 768]               0
        Attention-10             [-1, 577, 768]               0
         Identity-11             [-1, 577, 768]               0
        LayerNorm-12             [-1, 577, 768]           1,536
           Linear-13            [-1, 577, 3072]       2,362,368
             GELU-14            [-1, 577, 3072]               0
          Dropout-15            [-1, 577, 3072]               0
           Linear-16             [-1, 577, 768]       2,360,064
          Dropout-17             [-1, 577, 768]               0
              Mlp-18             [-1, 577, 768]               0
         Identity-19             [-1, 577, 768]               0
            Block-20             [-1, 577, 768]               0
        LayerNorm-21             [-1, 577, 768]           1,536
           Linear-22            [-1, 577, 2304]       1,771,776
          Dropout-23         [-1, 12, 577, 577]               0
           Linear-24             [-1, 577, 768]         590,592
          Dropout-25             [-1, 577, 768]               0
        Attention-26             [-1, 577, 768]               0
         Identity-27             [-1, 577, 768]               0
        LayerNorm-28             [-1, 577, 768]           1,536
           Linear-29            [-1, 577, 3072]       2,362,368
             GELU-30            [-1, 577, 3072]               0
          Dropout-31            [-1, 577, 3072]               0
           Linear-32             [-1, 577, 768]       2,360,064
          Dropout-33             [-1, 577, 768]               0
              Mlp-34             [-1, 577, 768]               0
         Identity-35             [-1, 577, 768]               0
            Block-36             [-1, 577, 768]               0
        LayerNorm-37             [-1, 577, 768]           1,536
           Linear-38            [-1, 577, 2304]       1,771,776
          Dropout-39         [-1, 12, 577, 577]               0
           Linear-40             [-1, 577, 768]         590,592
          Dropout-41             [-1, 577, 768]               0
        Attention-42             [-1, 577, 768]               0
         Identity-43             [-1, 577, 768]               0
        LayerNorm-44             [-1, 577, 768]           1,536
           Linear-45            [-1, 577, 3072]       2,362,368
             GELU-46            [-1, 577, 3072]               0
          Dropout-47            [-1, 577, 3072]               0
           Linear-48             [-1, 577, 768]       2,360,064
          Dropout-49             [-1, 577, 768]               0
              Mlp-50             [-1, 577, 768]               0
         Identity-51             [-1, 577, 768]               0
            Block-52             [-1, 577, 768]               0
        LayerNorm-53             [-1, 577, 768]           1,536
           Linear-54            [-1, 577, 2304]       1,771,776
          Dropout-55         [-1, 12, 577, 577]               0
           Linear-56             [-1, 577, 768]         590,592
          Dropout-57             [-1, 577, 768]               0
        Attention-58             [-1, 577, 768]               0
         Identity-59             [-1, 577, 768]               0
        LayerNorm-60             [-1, 577, 768]           1,536
           Linear-61            [-1, 577, 3072]       2,362,368
             GELU-62            [-1, 577, 3072]               0
          Dropout-63            [-1, 577, 3072]               0
           Linear-64             [-1, 577, 768]       2,360,064
          Dropout-65             [-1, 577, 768]               0
              Mlp-66             [-1, 577, 768]               0
         Identity-67             [-1, 577, 768]               0
            Block-68             [-1, 577, 768]               0
        LayerNorm-69             [-1, 577, 768]           1,536
           Linear-70            [-1, 577, 2304]       1,771,776
          Dropout-71         [-1, 12, 577, 577]               0
           Linear-72             [-1, 577, 768]         590,592
          Dropout-73             [-1, 577, 768]               0
        Attention-74             [-1, 577, 768]               0
         Identity-75             [-1, 577, 768]               0
        LayerNorm-76             [-1, 577, 768]           1,536
           Linear-77            [-1, 577, 3072]       2,362,368
             GELU-78            [-1, 577, 3072]               0
          Dropout-79            [-1, 577, 3072]               0
           Linear-80             [-1, 577, 768]       2,360,064
          Dropout-81             [-1, 577, 768]               0
              Mlp-82             [-1, 577, 768]               0
         Identity-83             [-1, 577, 768]               0
            Block-84             [-1, 577, 768]               0
        LayerNorm-85             [-1, 577, 768]           1,536
           Linear-86            [-1, 577, 2304]       1,771,776
          Dropout-87         [-1, 12, 577, 577]               0
           Linear-88             [-1, 577, 768]         590,592
          Dropout-89             [-1, 577, 768]               0
        Attention-90             [-1, 577, 768]               0
         Identity-91             [-1, 577, 768]               0
        LayerNorm-92             [-1, 577, 768]           1,536
           Linear-93            [-1, 577, 3072]       2,362,368
             GELU-94            [-1, 577, 3072]               0
          Dropout-95            [-1, 577, 3072]               0
           Linear-96             [-1, 577, 768]       2,360,064
          Dropout-97             [-1, 577, 768]               0
              Mlp-98             [-1, 577, 768]               0
         Identity-99             [-1, 577, 768]               0
           Block-100             [-1, 577, 768]               0
       LayerNorm-101             [-1, 577, 768]           1,536
          Linear-102            [-1, 577, 2304]       1,771,776
         Dropout-103         [-1, 12, 577, 577]               0
          Linear-104             [-1, 577, 768]         590,592
         Dropout-105             [-1, 577, 768]               0
       Attention-106             [-1, 577, 768]               0
        Identity-107             [-1, 577, 768]               0
       LayerNorm-108             [-1, 577, 768]           1,536
          Linear-109            [-1, 577, 3072]       2,362,368
            GELU-110            [-1, 577, 3072]               0
         Dropout-111            [-1, 577, 3072]               0
          Linear-112             [-1, 577, 768]       2,360,064
         Dropout-113             [-1, 577, 768]               0
             Mlp-114             [-1, 577, 768]               0
        Identity-115             [-1, 577, 768]               0
           Block-116             [-1, 577, 768]               0
       LayerNorm-117             [-1, 577, 768]           1,536
          Linear-118            [-1, 577, 2304]       1,771,776
         Dropout-119         [-1, 12, 577, 577]               0
          Linear-120             [-1, 577, 768]         590,592
         Dropout-121             [-1, 577, 768]               0
       Attention-122             [-1, 577, 768]               0
        Identity-123             [-1, 577, 768]               0
       LayerNorm-124             [-1, 577, 768]           1,536
          Linear-125            [-1, 577, 3072]       2,362,368
            GELU-126            [-1, 577, 3072]               0
         Dropout-127            [-1, 577, 3072]               0
          Linear-128             [-1, 577, 768]       2,360,064
         Dropout-129             [-1, 577, 768]               0
             Mlp-130             [-1, 577, 768]               0
        Identity-131             [-1, 577, 768]               0
           Block-132             [-1, 577, 768]               0
       LayerNorm-133             [-1, 577, 768]           1,536
          Linear-134            [-1, 577, 2304]       1,771,776
         Dropout-135         [-1, 12, 577, 577]               0
          Linear-136             [-1, 577, 768]         590,592
         Dropout-137             [-1, 577, 768]               0
       Attention-138             [-1, 577, 768]               0
        Identity-139             [-1, 577, 768]               0
       LayerNorm-140             [-1, 577, 768]           1,536
          Linear-141            [-1, 577, 3072]       2,362,368
            GELU-142            [-1, 577, 3072]               0
         Dropout-143            [-1, 577, 3072]               0
          Linear-144             [-1, 577, 768]       2,360,064
         Dropout-145             [-1, 577, 768]               0
             Mlp-146             [-1, 577, 768]               0
        Identity-147             [-1, 577, 768]               0
           Block-148             [-1, 577, 768]               0
       LayerNorm-149             [-1, 577, 768]           1,536
          Linear-150            [-1, 577, 2304]       1,771,776
         Dropout-151         [-1, 12, 577, 577]               0
          Linear-152             [-1, 577, 768]         590,592
         Dropout-153             [-1, 577, 768]               0
       Attention-154             [-1, 577, 768]               0
        Identity-155             [-1, 577, 768]               0
       LayerNorm-156             [-1, 577, 768]           1,536
          Linear-157            [-1, 577, 3072]       2,362,368
            GELU-158            [-1, 577, 3072]               0
         Dropout-159            [-1, 577, 3072]               0
          Linear-160             [-1, 577, 768]       2,360,064
         Dropout-161             [-1, 577, 768]               0
             Mlp-162             [-1, 577, 768]               0
        Identity-163             [-1, 577, 768]               0
           Block-164             [-1, 577, 768]               0
       LayerNorm-165             [-1, 577, 768]           1,536
          Linear-166            [-1, 577, 2304]       1,771,776
         Dropout-167         [-1, 12, 577, 577]               0
          Linear-168             [-1, 577, 768]         590,592
         Dropout-169             [-1, 577, 768]               0
       Attention-170             [-1, 577, 768]               0
        Identity-171             [-1, 577, 768]               0
       LayerNorm-172             [-1, 577, 768]           1,536
          Linear-173            [-1, 577, 3072]       2,362,368
            GELU-174            [-1, 577, 3072]               0
         Dropout-175            [-1, 577, 3072]               0
          Linear-176             [-1, 577, 768]       2,360,064
         Dropout-177             [-1, 577, 768]               0
             Mlp-178             [-1, 577, 768]               0
        Identity-179             [-1, 577, 768]               0
           Block-180             [-1, 577, 768]               0
       LayerNorm-181             [-1, 577, 768]           1,536
          Linear-182            [-1, 577, 2304]       1,771,776
         Dropout-183         [-1, 12, 577, 577]               0
          Linear-184             [-1, 577, 768]         590,592
         Dropout-185             [-1, 577, 768]               0
       Attention-186             [-1, 577, 768]               0
        Identity-187             [-1, 577, 768]               0
       LayerNorm-188             [-1, 577, 768]           1,536
          Linear-189            [-1, 577, 3072]       2,362,368
            GELU-190            [-1, 577, 3072]               0
         Dropout-191            [-1, 577, 3072]               0
          Linear-192             [-1, 577, 768]       2,360,064
         Dropout-193             [-1, 577, 768]               0
             Mlp-194             [-1, 577, 768]               0
        Identity-195             [-1, 577, 768]               0
           Block-196             [-1, 577, 768]               0
       LayerNorm-197             [-1, 577, 768]           1,536
        Identity-198                  [-1, 768]               0
        Identity-199                  [-1, 768]               0
================================================================
Total params: 85,646,592
Trainable params: 85,646,592
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.69
Forward/backward pass size (MB): 1437.49
Params size (MB): 326.72
Estimated Total Size (MB): 1765.90
----------------------------------------------------------------
